#### [ 결측치 처리 ]
 - 빈칸 즉, 데이터가 없는 부분을 의미
 - 결측치 체크 후 처리 방법 결정
 - 처리 방법
    * 제거
    * 치환

In [24]:
# 
import pandas as pd

In [25]:
file_name = 'data.csv'

In [26]:
# [3] CSV => DataFrame
dataDF = pd.read_csv(file_name)

In [27]:
# [4] 데이터 기본 정보 확인
dataDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   no      6 non-null      int64
 1   name    5 non-null      object
 2   age     5 non-null      float64
 3   gender  6 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 320.0+ bytes

In [28]:
# - 실제 데이터와 칼럼별 타입 체크
dataDF.head()

   no  name   age gender
0   1  Hong  10.0      F
1   2   NaN  13.0      F
2   3   Kim  10.0      M
3   4   Lee  16.0      F
4   5   Kim  10.0      F

In [29]:
# [5] 데이터 전처리 
# [5-1] 결측치 체크 => isnull(), isna() 메서드
dataDF.isna()

      no   name    age  gender
0  False  False  False   False
1  False   True  False   False
2  False  False  False   False
3  False  False  False   False
4  False  False  False   False
5  False  False   True   False

In [30]:
dataDF.isna().sum()     # isna까지는 데이터 프레임, 위 참고.

no        0
name      1
age       1
gender    0
dtype: int64

In [31]:
# [5-2] 결측치 처리 -> 삭제 1) 삭제 dropna 메서드
# - 기본값 : 행방향, 행 안에 1개의 칼럼이라도 Na면 삭제

dataDF.dropna() # all / any 2개 잇는데 디폴트는 any

   no  name   age gender
0   1  Hong  10.0      F
2   3   Kim  10.0      M
3   4   Lee  16.0      F
4   5   Kim  10.0      F

In [32]:
# - 설정값 : 열 방향, 열 안에 1개의 원소라고 NA면 삭제
dataDF.dropna(axis=1)

   no gender
0   1      F
1   2      F
2   3      M
3   4      F
4   5      F
5   6      M

In [33]:
# - 설정값 : 모든 원소가 NaN일 때 삭제 how='all'
dataDF.dropna(axis=0, how='all')

   no  name   age gender
0   1  Hong  10.0      F
1   2   NaN  13.0      F
2   3   Kim  10.0      M
3   4   Lee  16.0      F
4   5   Kim  10.0      F
5   6   Lim   NaN      M

In [34]:
# - 설정값 : 정상 데이터가 지정된 개수 미만이면 삭제
dataDF.dropna(axis=0, thresh=4)

   no  name   age gender
0   1  Hong  10.0      F
2   3   Kim  10.0      M
3   4   Lee  16.0      F
4   5   Kim  10.0      F

In [35]:
# - 설정값 : 특정 칼럼만 NAN여부 검사 진행 후 결정 ㅣ subset
# - 나이를 분석하고 싶음 -> 중요한 칼럼 age
dataDF.dropna(axis=0, subset=['age','name'])

   no  name   age gender
0   1  Hong  10.0      F
2   3   Kim  10.0      M
3   4   Lee  16.0      F
4   5   Kim  10.0      F

In [36]:
# [5-2] 결측치 처리 -> 방법 2) 대처/치환  fillna() 메서드
# # - 대체값 : 원하는 값 또는 칼럼의 평균값/최빈값 드응ㄹ 사용 가능.
            # 이전의 값 또는 이후의 값으로 대체

In [37]:
dataDF.filtna(0)

AttributeError: 'DataFrame' object has no attribute 'filtna'

In [ ]:
# 나이의 결축치는 나이 평슌으로 구하기
dataDF.fillwaw ( lpe:dataDF['age'.neat)())
dataDF.bfillill(dataDF = 'bbb ')   # 이전의 칼럼의 요소로저ㅏㅎㄴ

TypeError: ffill() got an unexpected keyword argument 'dataDF'

In [ ]:
dastDF['age']*(dataDF.)

In [ ]:
dastaDF.filana{'경계시']                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           ㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈㅈ ㅛㅎㅎ

In [38]:
dataDF.fillna(dataDF['name'].model()[0])

AttributeError: 'Series' object has no attribute 'model'